#ifndef BNUMIO_H
#define BNUMIO_H

/************************************************************************************/
/*		MAX_PATH_LENGTH - Максимальный размер пути к файлу							*/
/*		DEFAULT_FILE_PATH -Стандартное имя файла, из которого считывается число     */
/************************************************************************************/

#define MAX_PATH_LENGTH 151						
#define DEFAULT_FILE_PATH "input.txt"			


/************************************************************************************/
/*						Функция для чтения числа из файла							*/
/*																					*/
/*				int scanfile(OUT p_element numptr);									*/
/*			Выходные параметры: p_element numptr -									*/
/*			массив, в который будет помещено число, читаемое из файла				*/
/*																					*/	
/*			Возвращаемые значения: -1 - не удалось открыть файл						*/
/*									0 - число успешно считано из файла				*/
/*																					*/
/************************************************************************************/
int scanfile(OUT p_element numptr);


/************************************************************************************/
/*						Функция для вывода числа в файл								*/
/*																					*/
/*				int printFile(OUT p_element numptr);								*/
/*			Выходные параметры: p_element numptr -									*/
/*					число, которое нужно вывести в файл								*/
/*			Возвращаемые значения: -1 - не удалось открыть файл						*/
/*									0 - число успешно распечатано в файл			*/
/*																					*/
/************************************************************************************/
int printFile(IN p_element numptr);


/************************************************************************************/
/*			Функция для вывода числа в консоль в формате Little Endian				*/
/*																					*/
/*				void printConsoleLE(IN p_element numptr);							*/
/*			Входные параметры: p_element numptr -									*/
/*					число, которое нужно вывести в консоль							*/
/*																					*/
/************************************************************************************/
void printConsoleLE(IN p_element numptr);


/************************************************************************************/
/*			Функция для вывода числа в консоль в формате Big Endian					*/
/*																					*/
/*				void printConsoleLE(IN p_element numptr);							*/
/*			Входные параметры: p_element numptr -									*/
/*					число, которое нужно вывести в консоль							*/
/*																					*/
/************************************************************************************/
void printConsoleBE(IN p_element numptr);

#endif BNUMIO_H